"""Пользователь вводит число от 1 до 9999 (Баланс). Необходимо создать меню с которым пользователь может взаимодействовать,
вывести в консоль меню с товарами (виды кофе) и указать их цену. Пользователь покупает выбранный кофе.
Цена должна отниматься от баланса, обязательно создать проверки на нулевой баланс/большую цену и т.д.
В конце нужно указать что купил пользователь и словами указать сумму с правильным окончанием.
Например: Ви купили Лате, ваша сдача: 7431 – семь тысяч четыреста тридцать один доллар,
или 2149 – две тысячи сто сорок девять долларов, 15 – пятнадцать долларов, 3 – три доллара"""
